package days26;

public class Ex12 {

	// main 스레드 
	public static void main(String[] args) {
		// p 576 chapter 12장 멀티 스레드
		/*
		 * 1. 프로세스( process ) ?
		 *    운영체제에서는  "실행 중인 하나의 애플리케이션".
		 * 1-1. 다중 프로세스
		 * 2. 멀티 태스킹 (  multi tasking ) ?
		 *   두 가지 이상의 작업을 동시에 처리하는 것.
		 *   [운영체제]가 멀티 태스킹을 할 수 있도록 [CPU] 및 [메모리] 자원을
		 *   프로세스마다 적절히 할당해주고, 병렬로 실행시킨다. 
		 *   
		 *   메신져 실행 -> [프로세스]  - 파일전송 , 채팅..
		 * 2-2. 어떻게 하나의 프로세스가 두 가지 이상의 작업을 할 수 있나? 
		 *       멀티 스레드
		 *             
		 * 2. 스레드( thread ) ?
		 *   ㄱ. 사전적 의미 : 한 가닥의 실.
		 *   ㄴ. 유래 : 한 가지 작업을 실행하기 위해 순차적으로 실행할 코드를 실처럼
		 *        이어 놓았다고 해서 유래된 이름...
		 *   ㄷ. 
		 * 
		 * 3.  멀티 태스킹  -  멀티 프로세스
		 *      멀티 태스킹  -   멀티 스레드 
		 * 5.  메인(main) 스레드
		 *    ㄱ. main 스레드 == 독립적으로 실행되는 메서드
		 *    ㄴ. java.exe  실행
		 *         main 스레드에 의해  main() 메서드 실행...
		 *     ㄷ. main 스레드는 필요에 따라 작업 스레드를 만들어서
		 *     병렬로 코드를 실행할 수 있다.           
		 * */

	}

}





