package days17;

public class Ex02 {

	public static void main(String[] args) {
		// chapter 08 인터페이스  p 344
		/*
		 * 자바의 자료형
		 *   ㄱ. 기본형
		 *   ㄴ. 참조형  :  배열, 클래스(String), 인터페이스
		 * 
		 * 1. 인터페이스의 역할 ( ㄱ, ㄴ 암기 )  ***
		 *   ㄱ. 객체의 사용 방법을 정의한 타입이다. 
		 *   *** ㄴ. 객체의 교환성을 높여주기 때문에 다형성을 구현하는 
		 *              매우 중요한 역할을 한다. 
		 *   ㄷ. 개발 코드와 객체가 서로 통신하는 접점 역할을 한다.
		 *   ㄹ. 일종의 물리적인 클래스 이다.
		 *       ~~~.java
		 *       ~~~.class 
		 *   ㅁ. 인터페이스는 객체를 생성할 수 없기에 생성자가 필요없다.     
		 *   
		 *  2. 인터페이스 선언
		 *                               [C#] IremoteControl
		 *                               [R]emoteControl
		 *     접근지정자 interface 인터페이스명 {
		 *        // 클래스의 멤버 : 필드, 메서드, 생성자
		 *        // 인터페이스의 멤버 : 
		 *        //  ***상수  final static
		 *        //  ***메소드 
		 *        // JDK 1.7 이전 : 추상메서드만 abstract
		 *        // JDK 1.8 이후 : 추상메서드, 디폴트메서드, 정적메소드 
		 *     }
		 *        
		 * */

	}

}
