package days17;

public class Ex09 {
	
	//                                                매개변수 다형성
	public static void 사원급여출력메소드(Employee emp) {
		System.out.println( emp.getPay() );
	}

	public static void main(String[] args) {
		/*
		// 정규직
		Regular emp01 = new Regular("이석화", "위례 신도시"
				, "010-1234-1323", "2018-01-22", 3000000);
		// 영업직
		SalesMan emp02 = new SalesMan("김재곤", "포천"
				, "010-3423-1323", "2018-01-22", 500000, 20,100000);
		// 임시직
		Temp  emp03 = new Temp("이혜원","인천"
				,"010-3883-1231","2018-01-22",20, 150000);
		
		사원급여출력메소드(emp01);
		사원급여출력메소드(emp02);
		사원급여출력메소드(emp03);
        */		

		// p 318 하나의 배열로 객체 관리. ( == 클래스 배열 설명 )
		// int [] m = new int[3];      // m 배열명
		// 배열명 emps 
		/*
		Employee[] emps = new Employee[3]; 
		emps[0] = new Regular("이석화", "위례 신도시"             // 업캐스팅
				, "010-1234-1323", "2018-01-22", 3000000);
		emps[1] = new SalesMan("김재곤", "포천"                   // 업캐스팅
				, "010-3423-1323", "2018-01-22", 500000, 20,100000);
		emps[2] = new Temp("이혜원","인천"                  // 업캐스팅
				,"010-3883-1231","2018-01-22",20, 150000);
		*/
		
		// 클래스 배열 + 초기화
		// int [] m = new int[3];
		// m[0] = 1;
		// m[1] = 2;
		// m[2] = 3;
		//      int [] m = { 1, 2, 3}  배열 초기화
		Employee [] emps = { 
				new Regular("이석화", "위례 신도시"             // 업캐스팅
						, "010-1234-1323", "2018-01-22", 3000000)
				, new SalesMan("김재곤", "포천"                   // 업캐스팅
						, "010-3423-1323", "2018-01-22", 500000, 20,100000)
				, new Temp("이혜원","인천"                  // 업캐스팅
						,"010-3883-1231","2018-01-22",20, 150000)
				};
		
		// 다형성
		for (int i = 0; i < emps.length; i++) {
			사원급여출력메소드(emps[i]);
		} 
	}

}







